* Current Memory Usage
#+BEGIN_SRC python
from gilgamesh.logging import memory_warning
print(memory_warning(cutoff=4.0, node='-1', users=None))
#+END_SRC

#+RESULTS:
#+begin_example
2016-07-25 13:51
Total allocated memory:                    22.23 GB
user: apache                                5.65 GB

    Top 5 processes:
PID     MEM (GB)   COMM
86720   0.28       httpd
57837   0.28       httpd
57836   0.28       httpd
57835   0.28       httpd
57833   0.28       httpd

user: root                                  3.88 GB
user: jboes                                 2.23 GB
user: tianyug1                              2.06 GB
user: chenw3                                1.71 GB
user: fgeng                                 1.26 GB
user: devonw                                1.11 GB
user: jhaddad                               1.08 GB
user: jkitchin                              0.93 GB
user: tengm                                 0.75 GB
user: sbhartiy                              0.68 GB
user: yingjuy                               0.22 GB
user: gdm                                   0.22 GB
user: nobody                                0.21 GB
user: 68                                    0.07 GB
user: smmsp                                 0.06 GB
user: xfs                                   0.02 GB
user: rpc                                   0.02 GB
user: dbus                                  0.02 GB
user: rpcuser                               0.02 GB
user: ntp                                   0.02 GB

#+end_example

* Current CPU Usage
This

#+BEGIN_SRC python
from gilgamesh.logging import cpu_warning
print(cpu_warning(cutoff=2.0, node='-1', users=None))
#+END_SRC

#+RESULTS:
#+begin_example
2016-07-25 13:52
CPU load:                                   0.35 
user: chenw3                                0.23
user: jboes                                 0.04
user: tianyug1                              0.02
user: root                                  0.02
user: devonw                                0.01
user: sbhartiy                              0.01
user: jkitchin                              0.01
user: nobody                                0.01
user: fgeng                                 0.01
user: jhaddad                               0.00
user: tengm                                 0.00
user: rpcuser                               0.00
user: ntp                                   0.00
user: dbus                                  0.00
user: yingjuy                               0.00
user: apache                                0.00
user: rpc                                   0.00
user: smmsp                                 0.00
user: 68                                    0.00
user: xfs                                   0.00
user: gdm                                   0.00

#+end_example

